app/controllers/csv_controller.rb

  def new
  	@csvdata = Csv.all
---
SELECT * FROM "csvs"